dtdng/DinoGame-STM32F429/Core/Src/main.c
  /* Reset LCD control line(/CS) and Send command */
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_RESET);
  SPI5_Write(Reg);

  /* Deselect: Chip Select high */
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_SET);
}

/**
  * @brief  Reads register value.
  * @param  RegValue Address of the register to read
  * @param  ReadSize Number of bytes to read
  * @retval Content of the register value
  */
uint32_t LCD_IO_ReadData(uint16_t RegValue, uint8_t ReadSize)
{
  uint32_t readvalue = 0;

  /* Select: Chip Select low */
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_RESET);

  /* Reset WRX to send command */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_RESET);

  SPI5_Write(RegValue);

  readvalue = SPI5_Read(ReadSize);

  /* Set WRX to send data */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_SET);

  /* Deselect: Chip Select high */
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_SET);

  return readvalue;
}

/**
  * @brief  Wait for loop in ms.
  * @param  Delay in ms.
  */
void LCD_Delay(uint32_t Delay)
{
  HAL_Delay(Delay);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
	  osDelay(1);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_startPolling */
/**
* @brief Function implementing the hardware_pollin thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startPolling */
void startPolling(void *argument)
{
  /* USER CODE BEGIN startPolling */
  /* Infinite loop */
  int flag1 = 0, flag2 = 0;
  for(;;)
  {
	  GPIO_PinState Btn1State = HAL_GPIO_ReadPin(BTN_1_GPIO_Port, BTN_1_Pin);
	  GPIO_PinState Btn2State = HAL_GPIO_ReadPin(BTN_2_GPIO_Port, BTN_2_Pin);

	  if(Btn1State == GPIO_PIN_SET){
		  HAL_GPIO_WritePin(LD4_GPIO_Port, LD4_Pin, GPIO_PIN_SET);
		  if(flag1 == 0){
			  int buffer = 1;
			  HAL_Delay(10);
			  osMessageQueuePut(buttonQueueHandle, &buffer, 0, 10);
		  }
		  flag1 = 1;
	  }else{
		  HAL_GPIO_WritePin(LD4_GPIO_Port, LD4_Pin, GPIO_PIN_RESET);
		  flag1 = 0;
	  }
	  if(Btn2State == GPIO_PIN_SET){
		  HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_SET);
		  if(flag2 == 0){
			  int buffer = 2;
			  HAL_Delay(10);
			  osMessageQueuePut(buttonQueueHandle, &buffer, 0, 10);
		  }
		  flag2 = 1;
	  }else{
			int buffer = 3;
			osMessageQueuePut(buttonQueueHandle, &buffer, 0, 10);
		  HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_RESET);
		  flag2 = 0;
	  }
	  osDelay(1);
  }
  /* USER CODE END startPolling */
}

/* USER CODE BEGIN Header_sendRandomNumberTask */
/**
* @brief Function implementing the rngTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_sendRandomNumberTask */
void sendRandomNumberTask(void *argument)
{
  /* USER CODE BEGIN sendRandomNumberTask */
  /* Infinite loop */
  int16_t random = 0;
  for(;;)
  {
	random = TM_RNG_Get();
	osMessageQueuePut(randomNumberQueueHandle, &random, 0, 10);
    osDelay(1);
  }
  /* USER CODE END sendRandomNumberTask */
}

/* USER CODE BEGIN 6 */


/* USER CODE END 6 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
